Chemcrin/bionic-fish/仿生鱼完整项目交付包_v1/仿生鱼完整项目交付包/STM32控制工程/Core/Inc/main.h
/* USER CODE BEGIN Header */
/** @file main.h @brief 与原理图一一对应的唯一引脚定义。 */
/* USER CODE END Header */
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f1xx_hal.h"

/* TB6612：M1 直流减速电机接 A 桥，M2(N20) 直流减速电机接 B 桥。 */
#define TB6612_PWMA_Pin       GPIO_PIN_0
#define TB6612_PWMA_GPIO_Port GPIOA
#define TB6612_PWMB_Pin       GPIO_PIN_1
#define TB6612_PWMB_GPIO_Port GPIOA
#define TB6612_AIN1_Pin       GPIO_PIN_12
#define TB6612_AIN1_GPIO_Port GPIOB
#define TB6612_AIN2_Pin       GPIO_PIN_13
#define TB6612_AIN2_GPIO_Port GPIOB
#define TB6612_BIN1_Pin       GPIO_PIN_14
#define TB6612_BIN1_GPIO_Port GPIOB
#define TB6612_BIN2_Pin       GPIO_PIN_15
#define TB6612_BIN2_GPIO_Port GPIOB
/* TB6612 待机/使能脚（PB5）。**可选**：仅当 CFG_MOTOR_STBY_PIN_ENABLED=1 时才由
 * 固件驱动。历史版本把 STBY 直接硬接 3.3 V，代码里没有任何控制；2026-09-23 台架
 * 排查「电机不转」时把它做成可选 GPIO，便于用软件确认使能电平是否真的到位。
 * 若硬件仍把 STBY 硬接高，保持该开关为 0 即可，PB5 不会被占用。 */
#define TB6612_STBY_Pin       GPIO_PIN_5
#define TB6612_STBY_GPIO_Port GPIOB

/* 舵机。 */
#define SERVO_SIG_Pin         GPIO_PIN_6
#define SERVO_SIG_GPIO_Port   GPIOA

/* SSD1306：软件 I2C，不启用 STM32 I2C 外设。 */
#define OLED_SCL_Pin          GPIO_PIN_8
#define OLED_SCL_GPIO_Port    GPIOB
#define OLED_SDA_Pin          GPIO_PIN_9
#define OLED_SDA_GPIO_Port    GPIOB

/* JY61P：独立软件 I2C；RX/TX 未接 STM32，绝不分配 UART。 */
#define JY61P_SCL_Pin         GPIO_PIN_6
#define JY61P_SCL_GPIO_Port   GPIOB
#define JY61P_SDA_Pin         GPIO_PIN_7
#define JY61P_SDA_GPIO_Port   GPIOB

/* 按键和运行指示灯。 */
#define KEY1_Pin              GPIO_PIN_0
#define KEY1_GPIO_Port        GPIOB
#define KEY2_Pin              GPIO_PIN_1
#define KEY2_GPIO_Port        GPIOB
#define KEY3_Pin              GPIO_PIN_8
#define KEY3_GPIO_Port        GPIOA
#define RUN_LED_Pin           GPIO_PIN_13
#define RUN_LED_GPIO_Port     GPIOC

void Error_Handler(void);

#ifdef __cplusplus
}
#endif
#endif /* __MAIN_H */
